OFtutorialTest04_MRF/rhoSimpleFoam/aerofoilNACA0012/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    aerofoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       31760;
    }
    inlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          200;
        startFace       31880;
    }
    outlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          160;
        startFace       32080;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       32240;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       48240;
    }
)

// ************************************************************************* //
